{
  "posts": [
    {
      "id": "music-map-2026",
      "title": "MUSIC MAP",
      "slug": "music-map-blog",
      "publishDate": "2026-01-17",
      "excerpt": "If you know me personally, or even if you've encountered me virtually, you know I have an intense relationship with music. I title this piece \"MUSIC MAP,\" because like most, one's journey through music is an evolution...",
      "featuredImage": "music-map.jpg",
      "tags": [
        "Music",
        "art",
        "opinion"
      ],
      "readTime": 3,
      "fileName": "music-map-blog.html",
      "createdAt": "2026-01-17T18:09:41.673242",
      "source": "GitHub Actions"
    },
    {
      "id": "advice-from-a-college-graduate-2025",
      "title": "Advice From A College Graduate",
      "slug": "advice-from-a-college-graduate-blog",
      "publishDate": "2025-08-14",
      "excerpt": "Advice from a College Graduate After completing my Bachelor's degree in Political Science and taking some time away from school to gain some working experience, I found myself returning to University...",
      "featuredImage": "IMG_2452.jpg",
      "tags": [
        "college",
        "graduation",
        "university",
        "advice"
      ],
      "readTime": 4,
      "fileName": "advice-from-a-college-graduate-blog.html",
      "createdAt": "2025-08-14T15:28:23.748190",
      "source": "GUI Processing",
      "sourceFile": "Cats The Best Pets!.pdf",
      "paragraphCount": 3,
      "editedContent": "Advice from a College Graduate After completing my Bachelor's degree in Political Science and taking some time away from school to gain some working experience, I found myself returning to University life to complete my graduate degree. Because I was not new to academia, I was more determined than ever to keep track of sound advice-- a running list, so to speak, for students embarking on the venture we call higher education. Below I share my insights and pointers for students already in College and those perhaps considering the path of College: \n\n● Lot’s of people will ask you, “what do you want to do with this degree?” You do not need to know the exact answer, but you do need to know what you love and what makes you passionate. The experience of College could be just that-- helping you find your path.\n \n● Know your “why.” Why are you here? Why did you choose to start this program? Always remind yourself of this and never lose sight of it. \n\n● You WILL change your mind about many things-- your research interests, what you want to do for a thesis or applied project, or maybe even like me, changing your entire program. And that is OK.\n\n● Attend as many things as you can-- orientation, workshops, club meetings, etc. But do not over commit yourself of course, just go to what you think is relevant and what you think can help you. \n\n● Network! Talk to as many people as you can-- classmates, faculty, advisors, people even outside of the University but who have interests in your area. You never know who will come in handy. \n\n● Related, make it a goal (given you have the appropriate amount of time) to meet with someone new at least once a week, or maybe every other week. Keep these relationships going if you find them useful. \n\n● Document everything! For example, keep a running list of everyone you have contacted with their name and email and when you met with them. \n\n● Many people in academia, students AND teachers, will throw at you their negativity-- that grad school is horrible, that academia is such a backwards place, to why even bother, etc. Do not let that get you down and remember why YOU are there.\n\n● Get a sense of a program by reaching out to those already in the program-- start with an advisor, ask them to connect you to the director, to faculty, to current students. If you do not get a good vibe or if students seem to have lots of negative feedback, consider your options. \n\n● If something does not have a deadline(s), like a thesis or applied project (besides the final submission date) , make your own goal posts and timeline to keep yourself accountable and to not fall behind. \n\n● Even if you think something is not possible, ask anyway. By asking, you could be that one person who makes the wheels turn for something to change. \n\n● Search for and apply to internships early! \n\n● Try taking classes with professors who share similar research interests with you early on. This will help build a relationship with them and allow you to possibly have them on your committee later on.\n\nOf course, everyone's experience is different and some of my advice may or may not apply to you, but I can guarantee that at least a couple of these points can be useful-- even if you don't know it just yet! For what it's worth, I have not left academia and currently work at the very same University where I earned my BA and MA. I find myself encountering students who need that reminder of WHY quite often. Even for those who are not in academia, I feel it important to remind ourselves why we continue whatever it is we are doing. We work so we can afford a comfortable life. We spend a couple of hours a week exercising to stay healthy. We nurture our relationships to create friendship and community. The list goes on and on. So if you find yourself floundering in school work or second guessing your choice of major, just ask WHY.",
      "lastUpdated": "2025-08-14T15:32:09.672414"
    },
    {
      "id": "arizona-summers-2025",
      "title": "Arizona Summers",
      "slug": "arizona-summers-blog",
      "publishDate": "2025-08-05",
      "excerpt": "As a person born and raised in Arizona, I can confirm the brutality that is Summer in Arizona. Arizona natives are a rarity these days, and when a Phoenician like myself encounters someone new to the...",
      "featuredImage": "IMG_0449.JPG",
      "tags": [
        "summer",
        "activities",
        "arizona",
        "lake"
      ],
      "readTime": 4,
      "fileName": "arizona-summers-blog.html",
      "createdAt": "2025-08-05T17:03:08.967873",
      "source": "GUI Processing",
      "sourceFile": "Cats The Best Pets!.pdf",
      "paragraphCount": 6,
      "editedContent": "As a person born and raised in Arizona, I can confirm the brutality that is Summer in Arizona. Arizona natives are a rarity these days, and when a Phoenician like myself encounters someone new to the state, you bet that I give them the “summer spiel.” So read on to learn not just the warnings that come with the notorious AZ heat, but also things to make it more bearable and even some of the good aspects as well.\n\nBelieve it or not, you can start feeling the rumblings of Summer in AZ starting as early as April. This year (2025) for example, April 11th reached a high of 101 degrees! By May, you can count on Summer being in full swing all the way until the end of September, where we can finally experience highs below triple digits. The most unbearable segment of the season though has to be July and August. During the hot months, it is common to only exit the comfort of A/C for the essentials, like going to and from work, purchasing groceries and getting gas (standing by the gas pump is gnarly!).\n\nHowever, Phoenicians are tough, and we don’t let the Summer inhibit us from trying our best to make the most of it. This July for example, my partner and I enjoyed visiting Lake Pleasant with a group of friends-- we rode on jet skis and swam in the lake-- which is a perfect activity to have some fun, but also cool off when you need to. Similarly, my partner and I are lucky enough to have relatives close by who own a pool, so we make it a Friday ritual to take a relaxing dip in the pool-- something I think should be Arizona state law that all homes come equipped with a pool! If you do want to go on a hike or walk your dog though, best do that either super early in the morning (4:00am) or late at night (11:00pm).\n\nFor inside activities, venturing to the movie theater is a perfect way to escape the heat by enjoying a film inside a nice cool dark theater. As an added plus, Summer time is often when all the “Summer block-busters” are released, so it makes the tickets even more worth it (and the delicious popcorn of course!). Something else I was recently introduced to, and that makes a perfect indoor hobby, is the strategy card game Magic the Gathering (MTG). A competitively mystical game that takes some time to learn (for me at least) and that you can even play with only two players. Card/ board-games are ideal for those days when stepping outside is the last thing you want to do! Of course, there’s the other mainstream indoor hobbies as well, such asvideogames, reading, cooking, crafting, etc.-- so choose what makes most sense to you and the mood you're in.\n\nApart from the fun aspects, there are some rules everyone should abide by while making it through the summer heat. The most obvious-- drink lots of water! And this can’t be overstated enough-- approximately 4,298 people end up in Arizona emergency rooms every year due to heat-related illness (azdhs.gov). It comes as no surprise when I hear another person had to be airlifted from a mountain trail due to heat stroke. Other tools in one’s arsenal should include sun protection, like sunscreen, a hat and sunglasses. Especially for fair skinned individuals like myself, I know my scalp will literally crisp if I don’t wear a hat. Lastly, your car is an oven during the Summer, so please don’t end up as another statistic and don’t leave any children or pets in the car!\n\nI can say from years of experience that a part of me dies inside when I start to see the degrees in the forecast creep up, but I can’t deny the fact that I actually look forward to the smell of sunscreen and that first cannon ball into the pool each year. So if you're someone like me who finds Summer in Arizona pretty unbearable, try and find the bright side and just know that come September/ October, you will be grateful for the AMAZING Arizona Fall/Winter time!",
      "lastUpdated": "2025-08-05T17:03:48.575482"
    },
    {
      "id": "self-expression-clothing-edition-2025",
      "title": "Self Expression Clothing Edition",
      "slug": "self-expression-clothing-edition-blog",
      "publishDate": "2025-07-23",
      "excerpt": "Ever since I can remember, I have adored putting thought into my style/ fashion choices. Earlier than most, I refused when my mom chose clothes for me and opted to leave the house in a tutu, striped...",
      "featuredImage": "20241011_170150.jpg",
      "tags": [
        "fashion",
        "style",
        "clothing"
      ],
      "readTime": 3,
      "fileName": "self-expression-clothing-edition-blog.html",
      "createdAt": "2025-07-23T19:10:50.501928",
      "source": "GUI Processing",
      "sourceFile": "Cats The Best Pets!.pdf",
      "paragraphCount": 5,
      "editedContent": "Ever since I can remember, I have adored putting thought into my style/ fashion choices. Earlier than most, I refused when my mom chose clothes for me and opted to leave the house in a tutu, striped tights and those light-up shoes from the 90’s! So much so, that after obsessively watching the show “Project Runway,” I decided my career would be a fashion designer. I can confirm that that dream never came to fruition, but I still manage to use fashion as a form of self expression and enjoy piecing together outfits. The fun thing about fashion and style is that it’s what you make it. Sure, there are diehards who stick to a brand religiously, but rarely is one person’s entire wardrobe singular.\n\nWith that, style is also fluid and ever-changing (apart from those who are stuck in their heyday decade of fashion). For example, in highschool, I was much more conservative with my style choices-- jeans, tshirt, converse and natural hair color. However, once I was in college, I began experimenting with my hair color, adding accessories (I literally wore 10 bracelets on each wrist everyday) and expanding my pieces to include dresses, skirts, layers and even some fringe! The act of exploring one’s style can highlight different aspects of their personality and create a sense of belonging. I can say from experience, nothing brings me joy like when someone recognizes the band dawned on my tshirt-- a signifier of my music taste and a rally call to other like-minded fans. Style also serves as an unspoken “rule” amongst different groups and cultures.\n\nWhen I join my partner at the skatepark, I fit in with my branded tshirt, slim black jeans and checkered Vans. However, that same outfit doesn't blend in as well if I wore it into my office at work, which has a different style culture entirely. For the past decade or so, my wardrobe has been predominately black (with some white and red occasionally). I find myself drawn to the elegance and ease of wearing black. I also feel like it conveys my “style.” Although the use of black can be associated with gothic fashion, my style is a mix of gothic, skater, rocker and vintage. Because of this, my fashion icons are Vimpira, Courtney Love, Joan Jett and Mia Farrow. Along with garments, style can also be expressed with makeup, hair, accessories and even tattoos. For me, I do my makeup with a fair skintone, black wing-tipped eyeliner and a red lip. My hair is colored jet black with micro-bands and long layers. My shoes consist of Doc Martens boots, high-top converse and Vans slip-ons.And my tattoos showcase my various interests and things that are meaningful to me. Also, once you get one tattoo, it is almost impossible not to get more!\n\nWith the proliferation of the technological age, it is easier than ever to find brands that suit your personal style. So I end this piece with a list I have compiled of brands/ websites of where I have found some of my “hero pieces.” For the goth/ alt looks, I suggest checking out: Midnight Hour, Disturbia, Foxblood, BlackMilk, Ovate and La Femme En Noir. For the more vintage looks, check out: Classic Rock Couture, OXKNIT, MadCap and Joanie. Honorable mention as well to SUK Workwear for creating some stylish, yet versatile pieces.",
      "lastUpdated": "2025-07-23T19:14:31.835370"
    },
    {
      "id": "san-fransisco-adventures-2025",
      "title": "San Fransisco Adventures",
      "slug": "san-fransisco-adventures-blog",
      "publishDate": "2025-07-16",
      "excerpt": "In May of this year, my partner and I made a trip to the iconic “city by the bay,” San Francisco. Although the primary cause of our trip was to see my favorite musician, Jack White, we made several...",
      "featuredImage": "san fran.jpg",
      "tags": [
        "san-fransisco",
        "jack-white",
        "live music",
        "concert"
      ],
      "readTime": 4,
      "fileName": "san-fransisco-adventures-blog.html",
      "createdAt": "2025-07-16T20:58:28.632013",
      "source": "GUI Processing",
      "sourceFile": "San Fransisco Adventures .pdf",
      "paragraphCount": 7,
      "editedContent": "In May of this year, my partner and I made a trip to the iconic “city by the bay,” San Francisco. Although the primary cause of our trip was to see my favorite musician, Jack White, we made several memories both inside the concert and out!\n\nWith such a brief flight from our hometown of Phoenix, AZ, SF is one of our favorite weekend destinations, offering a nice contrast to our desert dwelling. Although SF can be pricey and parking is always questionable, it makes up for it with the bike/walkability. On our first morning, we made a short drive from our hotel and walked around a quaint city square where we happened upon a local shop: Dead Eye Coffee Bar. My iced beverage featured Ube, purple yam, often featured in traditional Filipino dishes that offers a deliciously creamy vanilla flavor. Consequently, we later encountered this ingredient when we ventured to a nearby bar and enjoyed Ube cocktails! \n\nAfter our much needed caffeine, my partner and I visited the iconic Fisherman’s Wharf. My spirits were lifted when I learned that the seals were perched at their usual barge, barking and flailing about (last time we went they weren't there). I was also greeted by an adorable shop cat as we walked along the various purveyors-- I can’t ever get enough animal encounters! Exploring the Piers, we enjoyed a ride in these large 3D-printed seats that moved like a toy spinning top-- truly a sight to see! Of course, we also took the opportunity to snap some beautiful pictures of the Piers architecture and selfies by the water.\n\nLeaving some room to rest, we then got ready for our highly anticipated Jack White concert at The Masonic. As we waited in line to enter the auditorium, I was reminded just how much I enjoy being surrounded by “my people”-- Jack White fans! As we waited, I admired all the patrons' various Jack White (or adjacent) garb. I myself wore a corduroy jumpsuit with Jack White’s iconic black and blue color scheme, paired with leather white boots. After filing inside, we bought pricey cocktails (what do you expect at a concert venue!) and then headed right to the concert floor, where I managed to secure a close spot just right of center stage. While eagerly awaiting the show to start, I made a handful of friends out of those surrounding our little concert cove. Two of our fellow concert goers were from France, along with CA locals and we all swapped our Jack White fan stories.\n\nThe show opened with a local hard-core punk band named, THE LOSERS. Although a little too heavy for my liking, I am always impressed by Jack White’s efforts of showcasing localbands who are a little off the beaten path, so to speak. FINALLY!! The legendary Jack White graced the stage with his signature wild black hair, dawning a fashionably coordinated black and yellow outfit, courtesy of Third Man Records. Slightly less interactive than previous shows I've been to, Jack mostly played songs from his latest album, NO NAME. Of course, Jack is always impressive live and I really enjoyed dancing my booty off with all the new friends I made! I am so good at making friends in fact, that I was even chosen as the designated bathroom chaperone on two separate occasions during the show. I must admit, I impressed myself even at my ability to weave through the crowd and then reenter, somehow finding my way back to our group close to the stage-- and this is after a few drinks no less!\n\nAfter a meaty encore, Jack and the band took a final bow, left the stage and the lights came back on. One of the friends we had made, a SF local, approached us to ask if we wanted to “keep the party going,” to which we graciously obliged. After finding parking, we were led to Vesuvio Cafe. This place was so adorable and right up my alley! After ordering drinks, we scaled the tight spiral staircase and sat upstairs near a window, with a view to the side alley below, where a local band was serenading a gathering of people. I felt like I was in a quaint hip cafe in Europe, sipping drinks over conversation with the sound of live music flowing through the open window. After fetching another round, our trio made our way downstairs and outside, where we sat right by the band. Our local friend was acquainted with the band and told them of our concert, which inspired them (to my delight) to start playing “Hardest Button to Button,” by The White Stripes. With only an hour before bars start closing, we made our way to another bar in Little Italy called Gino & Carlo. Once again, our friend knew the bartender and we enjoyed the rowdy late-night atmosphere of the vintage dive bar.\n\nAs we dropped our friend off and headed back to our hotel, I was awe-struck by our night-- something that can only happen organically. I can say for certain that we were lucky to have met the people we did at the right time and place. An experience that only made me love San Francisco even more and a night I will forever cherish!",
      "lastUpdated": "2025-07-16T21:00:20.545922"
    },
    {
      "id": "az-renaissance-festival-2025",
      "title": "Az Renaissance Festival",
      "slug": "az-renaissance-festival-blog",
      "publishDate": "2025-07-16",
      "excerpt": "The Arizona Renaissance Festival (Ren Fest for short) is a staple of Arizona Spring time activities. Located in Apache Junction, near the Superstition Mountains, the festival runs from the start of...",
      "featuredImage": "az_renaissance_festival_blog.png",
      "tags": [
        "travel",
        "arizona",
        "renaissance",
        "festival"
      ],
      "readTime": 3,
      "fileName": "az-renaissance-festival-blog.html",
      "createdAt": "2025-07-16T20:31:46.281444",
      "source": "GUI Processing",
      "sourceFile": "AZ Renaissance Festival.pdf",
      "paragraphCount": 5,
      "editedContent": "The Arizona Renaissance Festival (Ren Fest for short) is a staple of Arizona Spring time activities. Located in Apache Junction, near the Superstition Mountains, the festival runs from the start of February to the end of March, each weekend, “rain or shine.” Likely, other states put on their own Ren Fests, but I will be specifically discussing the Arizona-based function, as it is the only one I have experienced.\n\nGrowing up, I have memories of being taken to this strange affair. I remember grown adults dressed as fairies and scattered booths with flower crowns and palm readers galore. It’s funny to think that even as a child, I was not convinced of their fortune reading abilities! One can think of the Ren Fest as a type of Comic Con, but geared more towards those who enjoy Medieval/ Fantasy type realms. Don’t get me wrong, over the years, the festival has catered to the Comic community, with one of their weekends being advertised as “Star Wars themed,” but at its core, it encompasses the shield wielding, horse riding, turkey leg eating, fairy dust culture.\n\nThe appeal of the Ren Fest comes from the variety of attractions and things to do. There are plenty of shows, the most well known being the Jousting Tournament, there’s loads of shopping to choose from, food and drink to indulge on, including alcoholic beverages, and you can even get a kick out of seeing the die-hard Ren Fest goers who use this gathering to let their “freak flag fly!” If you are someone foreign to this type of “nerd culture,” this is your opportunity to rub elbows with people who count down the days until they can show off their meticulously crafted garb, practice their Old English accent and spend their savings on Medieval mementos. I am certainly no die-hard when it comes to the Ren Fest, (my version would be a Jack White concert) but I enjoy attending with those whom it brings lot’s of joy, and also for my own motives, which I will get to next.\n\nWhen I embark on the Ren Fest adventure, I abide by the same format each year. First, I make sure to go with my closest friend, who happens to be one of those “die-hards,” I purchase the specialty garlic powder requested by my Mom, I buy a year’s worth of handcrafted incense (really, the best out there!) I drink at least two alcoholic beverages and I attend one Jousting Tournament. If you have a friend who is really into this kinda stuff, it’s always best to be chaperoned by them-- my friend has the map of the Ren Fest literally ingrained into her memory!She also knows all the best tips and tricks, like where to sit during the Jousting Tournament so as to get the least amount of sun. This year, I even splurged and bought myself a corset! I have always enjoyed playing dress up and thought that the corset would not only get it’s use at my yearly Ren Fest attendance, but could also be incorporated into a Halloween costume. This justified my purchase! All this to say, even if you are not a huge fan of Medieval/ Fantasy lore, I can guarantee that there will be SOMETHING at the Ren Fest to make it worth your while-- even if that’s a guy on stilts insulting passerbyers!\n\nWhat I've learned: Arizona weather can be unpredictable-- it might be scorching hot and it might be beautifully overcast-- either way, make sure to research weather conditions before going and be prepared. The Ren Fest grounds are quite literally ground, as in dirt, so don’t wear anything you're afraid to get dirty. All food and drink purchases are cash only, so bring some cash to avoid ATM fees when you find yourself salivating for some grub. Be prepared to see a variety of people wearing beautiful, and sometimes bizarre, costumes-- this is their turf and we are simply guests in their world of imagination and play. Finally, go into the experience with an open mind and try to have fun!",
      "lastUpdated": "2025-07-16T20:39:52.717508"
    },
    {
      "id": "gatlinburg-tn-2025-2025",
      "title": "Gatlinburg Tn 2025",
      "slug": "gatlinburg-tn-2025-blog",
      "publishDate": "2025-07-16",
      "excerpt": "This year, I was graciously invited to my partner’s annual family vacation-- this time to Gatlinburg, TN. Read on to learn about our 6-day adventure in the mountain town of Eastern Tennessee!",
      "featuredImage": "gatlinburg.jpg",
      "tags": [
        "travel",
        "tennessee",
        "gatlinburg",
        "vacation"
      ],
      "readTime": 4,
      "fileName": "gatlinburg-tn-2025-blog.html",
      "createdAt": "2025-07-16T20:29:59.709695",
      "source": "GUI Processing",
      "sourceFile": "Gatlinburg TN 2025.pdf",
      "paragraphCount": 8,
      "editedContent": "This year, I was graciously invited to my partner’s annual family vacation-- this time to Gatlinburg, TN. Read on to learn about our 6-day adventure in the mountain town of Eastern Tennessee!\n\nAs with most cross-country excursions, the first day of traveling can be a bit exhausting. We flew into Nashville, TN (Knoxville tends to have more expensive flights) and drove about four hours to our destination in Gatlinburg. On the way, we stopped at the world famous Buc-ee’s! As a west-coast dweller, the spectacle of Buc-ee’s was completely new to me and can be best described as a Costco-sized gas station with rows and rows of gas pumps, a convenience store to the max and the cleanest bathrooms you could ask for on a road trip! Although I was not fond of the crowds of people and bountiful selection of beef-jerky, I was relieved to find a clean bathroom with numerous stalls. It is also a right of passage to visit a Buc-ee’s on that side of the country.\n\nUpon arrival, we checked into our hotel-- Margaritaville. Despite the cheesy reputation, I was pleasantly surprised by the quality of the place. My partner and I stayed in a room nearly the size of a studio apartment, complete with a huge shower with multiple shower heads and even a beautiful balcony facing the front of the hotel. I guess it was also suiting that we stayed in Margaritaville over Cinco De Mayo, and yes, I enjoyed several margaritas at the hotel bar over the course of our stay!\n\nAfter getting a good night’s rest (thank you blackout curtains!) the family gathered for a trip to Anakeesta, a “mountaintop adventure park,” walking distance from our hotel. Actually, to get to the attraction we had to take a ski lift to the top of the mountain, which in itself was fun! Anakeesta was enjoyable, but expect to do lot’s of walking! There were several attractions to stay busy and get your money’s worth, such as the smokey mountain observatory tower, treetop skywalk and two mountain coasters. There were also plenty of shops, a restaurant and a really cool bar at the observatory.\n\nApart from Anakeesta, which was the main attraction down the strip we were staying at, there were a number of touristy attractions to keep busy. My partner and I enjoyed visiting two different arcades and the rest of the family explored one of the many mini-golf attractions. One day, we all went to the Ripley’s Aquarium of the Smokies. The aquarium was fun, but a bit expensive given the time it took to see everything. Like most tourist locations, the variousvendors are aware that patrons are at the mercy of the parameters of said trip and can charge what they want since they are the ones supplying the “things to do.” Ultimately, if it were just my partner and I traveling, we would have opted for an Airbnb closer to the smokies, where you can venture in nature (no cost) and buy/cook all of your food from home instead of paying everywhere-- truly a water bottle on the trip was a luxury!\n\nOf course, when visiting Gatlinburg, attending Dollywood is a must! Dollywood was only about a twenty minute drive from our hotel into Pigeon Forge, and it just so happened to be the 40th anniversary of its inception. The tickets were about $100 each after taxes and fees, but reasonable considering the amount of attractions (not nearly as expensive as Disney!). It might have been because it was raining all day, but the ride wait times were also very reasonable and their “timesaver passes” were not necessary. My partner and I enjoyed riding several of the rollercoasters, my favorite was the Wild Eagle, and we even managed to purchase their famous cinnamon bread! Out of all the different activities in and near Gatlinburg, this was definitely my favorite-- I highly recommend stopping by if you find yourself in the area.\n\nOn our final day, my partner and I were dropped off in Nashville-- the rest of the family was staying a few more days in Franklin. And we weren't just dropped off anywhere, but none other than Third Man Records! Even better, one of my fellow Third Man fans, and good friend, met up with us (he and his wife live in Nashville). After breaking the bank at Third Man, the Nashville natives took us down Broadway, where we enjoyed our drinks over live music. Afterwards, we visited their beautiful home, equipped with a few fur-babies! After several days of being away from home, I couldn’t have asked for a better ending to our trip-- surrounded by friends that make you feel at home!\n\nOverall, I think I sufficiently explored Gatlinburg, but I definitely see myself one day spending time hiking in the actual Smokey Mountains and 100% spending more than just a few hours in Nashville!",
      "lastUpdated": "2025-07-16T20:45:54.056630"
    },
    {
      "id": "jack-white-concert-1-23-23-2025",
      "title": "Jack White Concert 1 23 23",
      "slug": "jack-white-concert-1-23-23-blog",
      "publishDate": "2025-07-16",
      "excerpt": "This was truly one of the best nights of my entire life thus far, so I have decided to type it down to preserve the memory. Although this was not my first Jack White (JW) concert, it was the first...",
      "featuredImage": "jack_white_concert_1_23_23_blog.png",
      "tags": [
        "music",
        "concert",
        "jack-white",
        "rock"
      ],
      "readTime": 4,
      "fileName": "jack-white-concert-1-23-23-blog.html",
      "createdAt": "2025-07-16T20:27:48.949788",
      "source": "GUI Processing",
      "sourceFile": "Jack White concert_1_23_23.pdf",
      "paragraphCount": 9,
      "editedContent": "This was truly one of the best nights of my entire life thus far, so I have decided to type it down to preserve the memory. Although this was not my first Jack White (JW) concert, it was the first time I was “solo rollin’” on my own-- driving from AZ to L.A. Below, please find my fangirl account of attending Jack White’s Supply Chain Issues tour-- L.A. show at the Belasco theater.\n\nAfter a lengthy car ride to L.A., I arrived at the venue one hour before the doors opened. Apparently that wasn't early enough-- the line was already wrapped around the budding! But waiting was super fun! I had never been around so many JW supporters and die-hards in my life! I enjoyed chatting with everyone about past concert experiences and JW facts, I also loved seeing everyone show off their t-shirts or even Jack costumes! In fact, I even took a picture with two gentlemen dressed as Jack!\n\nFinally the doors opened and the line began to spill in as we all locked our phones away in their designated pouches. When I entered the ornate theater I was amazed at the beauty-- but not for too long! The event was standing room only, so most people were rushing to the stage to get the closest spot available! I ran in and managed to get about 10 feet from the stage-- 10 FEET FROM JACK WHITE!!! I had gotten a wrist band indicating I was 21 and could drink, but there was NO WAY I was moving from that spot to get a drink or go to the bathroom!\n\nWhile everyone was anxiously waiting, that annoying DJ, who had been at all of Jack’s shows for the Supply Chain Issues tour, was “entertaining us” with music. After an hour, the opening act came on-- Jack’s wife, Olivia Jean. She was alright, most of her stuff sounded the same, and everyone was there for JACK!!!\n\nWith the crowd beyond pumped up, Jack came out, energetically running across the stage as usual! I was immediately shocked to see his iconic Fear of the Dawn blue hair back to his original black-- but he looks great in any color! Jack began the show with “Taking Me Back” his guitar booms “BOM BOM” “BOM BOM” but then his amp cord gets ripped from his guitar-- I can’t help but find it so charming when Jack gives a little embarrassed smile as he quicklyshoves the cord back in. This is something that can be explained so much better through impersonation, but you get the picture!\n\nAs the show goes on I really start to realize what a different concert going experience this is for me. Everyone around me is shoulder to shoulder, we are all sweating like mad, but there’s also this shared energy that feels like nothing else. It was truly magical. Above the stage on either side were the VIP sections. I was immediately able to spot Conan O’Brian and Jack Black. But then again, the VIP couldn't catch the picks or the sweat towel that Jack threw to the crowd! Unfortunately, I was not one of the lucky ones. 🙁 \n\nJack started playing “Steady as she Goes” and towards the end interrupted the song to engage with the crowd asking “Now, L.A. have I asked too much of you tonight?” of course everyone shouts “NOOO!” So then Jack asks everyone if they could please get down on the ground and that when he sings “Steady as she goes” we reply with “are you steady now?” Everyone obeys of course and the exchange is awesome! Eventually we all got back up again and that’s when I realized my pants were covered in beer! I guess since nobody wants to leave their spot to throw something away, the floor becomes a trash can.\n\nOf course the band “leaves'' the stage and then the crowd starts chanting for Jack to return-- we even break out into singing “Seven Nation Army!” Finally Jack enters the stage for his lengthy encore. Then all of a sudden, I see this dude dressed in the Elephant album outfit surfing the crowd! And right by me! I was fortunate enough to help pass the body along.\n\nAs I watched as the band took their bows and said their goodbys, I thought to myself, this is truly the best night of my life.” Yes I was tired, yes I was dehydrated, yes I was sweating like a pig, yes I was covered in beer, and yes my ears hurt like hell, but this was an AMAZING concert going experience and I hope to have more like it."
    },
    {
      "id": "the-windsor-2025",
      "title": "The Windsor",
      "slug": "the-windsor-blog",
      "publishDate": "2025-07-16",
      "excerpt": "Located on North Central Ave. in Phoenix, AZ lies my all time favorite restaurant-- The Windsor! Their website describes the place as “a neighborhood bar and restaurant” that offers “high quality...",
      "featuredImage": "the_windsor_blog.png",
      "tags": [
        "food",
        "restaurant",
        "phoenix",
        "dining"
      ],
      "readTime": 4,
      "fileName": "the-windsor-blog.html",
      "createdAt": "2025-07-16T20:25:22.744608",
      "source": "GUI Processing",
      "sourceFile": "The Windsor.pdf",
      "paragraphCount": 6,
      "editedContent": "Located on North Central Ave. in Phoenix, AZ lies my all time favorite restaurant-- The Windsor! Their website describes the place as “a neighborhood bar and restaurant” that offers “high quality wine and beer, prohibition era cocktails and casual and familiar bar food with an upscale twist.” \n\nFrom the outside, guests are greeted with a beautifully rustic brick building, covered in lush greenery and outdoor seating. When first entering, they are met with an entire wall made of cassette tapes! You can often find patrons snapping photos with the “retro” backdrop of the cassettes or attempting to read the various albums/ artists that adorn the wall. Really, the best area to wait for an open bathroom stall. Once inside, one is welcomed by the moody aesthetic, complete with dark booths and dim lighting, a bar that takes center stage, dark green walls and eccentric art. To compliment the atmosphere, The Windsor always supplies an awesome playlist of some of my favorite artists, such as The Strokes, Arctic Monkeys, The Beatles, Bob Dylan, and Talking Heads, to name a few!\n\nEven when they are swamped, you can always count on one of the amazing Windsor staff to greet and seat you. The staff themselves seem almost curated to the very atmosphere that The Windsor exudes, oftentimes wearing hip, posh clothing and showcasing their individuality-- something The Windsor embraces not only from their staff, but the patrons as well! Over the years, I have made acquaintances with several of The Windsor employees, a couple of them have even become close friends indeed! It is hard not to strike up a conversation in such a welcoming place with welcoming people. I also enjoy how the staff basically “share” their tabling duties, so never be afraid to reach out to one of their wonderful employees-- they all share in accommodating patrons.\n\nI haven't even gotten to the food and drinks yet! The Windsor is great at including just the right amount of dishes and swapping out new ones on a regular basis. I cannot tell you how much I dislike having to read through a giant menu! Simplicity is key in my book. Because I am a creature of habit, you can always count on me splitting the Windsor burger with fries and a side of ranch with my boyfriend. I am typically not a huge meat eater, but I can say in all honesty that the burgers made at The Windsor are fantastic and actually make me crave their deliciousburgers! The buttermilk ranch is also to die for! But what I truly love on the menu is their selection of craft cocktails. I have tried many of their cocktails over the years and they even introduce a weekly “bartender’s choice” if you are feeling adventurous. One that I hope never disappears from the menu is the #88, which includes gin and floral goodness that can only be described as “the nectar of the gods!” Pro tip: The Windsor offers a great happy hour deal with nearly half off cocktails from open to 5:00pm daily. I have been known to take advantage of happy hour, sometimes having two to three cocktails myself. How else would I be able to expand my palate and provide you with accurate reviews???\n\nAnd if it couldn’t get any better, The Windsor offers dessert directly supplied from their sister establishment, CHURN, which is literally attached to the same building! Towards the end of your meal, you will be given a CHURN menu, which includes a variety of house-made ice cream flavors and cookies that serve as literally the cherry on top of the entire dining experience at The Windsor! You can even choose to turn an ice cream into a shake, and for that, I suggest the Vietnamese coffee flavor. Oftentimes, I will want my dessert to go, and the staff are so courteous, going so far as to even place my to-go cookie near an oven so as to keep warm.\n\nIn summary, although I am a big fan of all of the Upward Projects establishments, I can say wholeheartedly that The Windsor wins the gold! I cannot even count how many wonderful memories I have made at The Windsor, whether it was celebrating a birthday, going out on a romantic date or just catching happy hour for some drinks. I hope that The Windsor keeps on rockin 'and rollin' for many years to come, and if you haven't already, go check it out!",
      "lastUpdated": "2025-07-16T20:40:01.196441"
    },
    {
      "id": "cats-the-best-pets-2025",
      "title": "Cats The Best Pets",
      "slug": "cats-the-best-pets-blog",
      "publishDate": "2025-07-16",
      "excerpt": "I am always taken by surprise when I learn that someone doesn’t like cats. And I am even more shocked to hear there are people who absolutely despise cats! And maybe you are someone on the fence...",
      "featuredImage": "cats_the_best_pets!_blog.png",
      "tags": [
        "pets",
        "cats"
      ],
      "readTime": 4,
      "fileName": "cats-the-best-pets-blog.html",
      "createdAt": "2025-07-16T20:24:11.934063",
      "source": "GUI Processing",
      "sourceFile": "Cats The Best Pets!.pdf",
      "paragraphCount": 5,
      "editedContent": "I am always taken by surprise when I learn that someone doesn’t like cats. And I am even more shocked to hear there are people who absolutely despise cats! And maybe you are someone on the fence about cats, so hopefully with some more exposure, and by reading this blog, you just might start to warm up to the wonderful world of house cats!\n\nEven before I was born, my Mom had a cat named Harley, and so I was brought into this world in a home also inhabited by a cat. As a baby, I would often chase after poor Harley in my baby walker and grab at her tale. One day, I even asked why the bottom side of the tomato“looks like Harley’s butt!” So I can certainly say from experience that cats are suitable for families, including young babies who try and terrorize them! Cats are enduring creatures and will put up with a lot, though they might show their annoyance every now and then with a hiss and a swipe.\n\nThis is not to say that dogs, or other house pets are no good, but cats are just simply superior. I think cats even know how superior they are. Yes, I have owned a few dogs in my life, and I believe that they would also attest to cats being at the top of the metaphorical “house pet food-chain.” My most adored dog, Desmond, who was a pitbull rottweiler mix, weighing a whopping 130 pounds, would always submit to our cats. It was almost comical watching Desmond cower when one of our cats put him in his place if he got out of line. And by getting out of line, I mean unknowingly standing in the way of the cat or perhaps snuggling too hard for the cat's liking. In my opinion, most dogs are pretty similar in their wants/ needs-- they just want to serve as a companion and want your love and attention in return. And also food scraps of course! Whereas, there is actually quite the variation from cat to cat and they each have their own unique personality.\n\nSome cats prove to be just as needy and attention seeking as dogs, whereas other cats could care less about your presence, unless they want something on their terms. One of my cats, Tarot, works like clockwork! In the evening, she will come to mount me on the sofa for her nightly pets. Tarot’s petting sessions only last about 20 minutes at most. When Tarot notices that everyone is done with work, she will request her afternoon stroll through the backyard, where she enjoys rolling on the concrete and dirt and sniffs all the outdoor smells. On the other hand, one of our other cats, Jade, will literally cry like a child if you leave the room without notifying her. Jade is also very possessive, so if another cat decides to seek out your attention, Jade willprey on the unassuming cat, just as a lion hunts for its meal in the safari. But in the end, if we must leave the house, even for a day trip, we are comfortable leaving our cats at home, supplied with food, water and toys. Yes, we have been welcomed by cat yak (on the carpet, not the tile of course) or a scratch on the upholstery, but nothing to the effect of eaten shoes or furniture like a dog might do. As long as your cat(s) have food, water, a clean cat box to go potty, items to stimulate them (like catnip toys or a scratching post) a comfy nest to sleep, preferably under direct sunlight and the occasional attention (on their terms only) they are pretty content.\n\nI mean, there must be a reason why the Egyptians thought of cats as deities, right?! If you haven't been convinced yet, let me give you my elevator pitch: Cats are unique, they have their own personalities, cats are (for the most part) pretty tolerable creatures, cats do not need constant supervision or attention, cats are pretty clean and don’t drool and slobber everywhere, cats are almost automatically inclined to use a litter box (very little potty training needed), cats require very few essentials to be happy. Cats also supply loads of entertainment for us humans-- just goggle all the pictures of cats laying on glass tables and you will understand! In short, I will, and have always been, a cat lover and truly believe that they are THE BEST pets one could own!",
      "lastUpdated": "2025-08-14T15:30:35.022654"
    }
  ],
  "lastUpdated": "2026-01-17T18:09:41.673439",
  "totalPosts": 10
}